cpp_moderno_indice.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-09-09 Tue 12:09 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgfbff0d5">1. Índice</a></li>
<li><a href="#org57df139">2. Introdução</a></li>
<li><a href="#org24ecd8d">3. Estrutura do Livro</a>
<ul>
<li><a href="#org0403b29">3.1. Parte I — A Profundidade da Linguagem</a></li>
<li><a href="#org0088b9c">3.2. Parte II — Templates e Programação Genérica</a></li>
<li><a href="#org74d81b6">3.3. Parte III — Metaprogramação e Compile-Time Magic</a></li>
<li><a href="#orgd91e3c4">3.4. Parte IV — Arquitetura e Design com C++</a></li>
<li><a href="#org2199edb">3.5. Parte V — Programação de Baixo Nível e Desempenho</a></li>
<li><a href="#orgea00311">3.6. Parte VI — Concorrência e Computação Distribuída</a></li>
<li><a href="#org4ec3777">3.7. Parte VII — C++ no Ecossistema Moderno</a></li>
<li><a href="#orgce32298">3.8. Parte VIII — O Futuro do C++</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgfbff0d5" class="outline-2">
<h2 id="orgfbff0d5"><span class="section-number-2">1.</span> Índice</h2>
<div class="outline-text-2" id="text-1">
<p>
<del><a href="./capitulo_1_errado.html">Capítulo 1: Introdução ao CPP Moderno</a></del>
<a href="./capitulo_1.html">Capítulo 1: Mergulhando no C++ Moderno: Fundamentos e Filosofia</a>
<a href="./capitulo_2.html">Capítulo 2: Tipos Fundamentais, Variáveis e Controle de Fluxo: Os Átomos da Lógica</a>
<a href="./capitulo_3.html">Capítulo 3: A Anatomia dos Dados: Um Mergulho Profundo nos Tipos Primitivos</a>
<a href="./capitulo_4.html">Capítulo 4: A Realidade Física dos Dados: Alinhamento, Conversões e o Abismo do Indefinido</a>
<a href="./parada_estrategica.html">Parada Estratégica: Subir ou Descer o Nível?</a>
<a href="./interludio_1.html">Interlúdio: Um Mapa Para a Maestria — Por Que o Caminho Importa?</a>
<a href="./capitulo_5.html">Capítulo 5: Funções — A Arte de Organizar a Lógica</a>
<a href="./capitulo_6.html">Capítulo 6: A Mecânica das Funções — Por Baixo dos Panos</a>
<del><a href="./capitulo_7_errado.html">Capítulo 7: Agregando Dados — A Simplicidade e o Poder das Structs</a></del>
<a href="./capitulo_7.html">Capítulo 7: Definindo Dados e Constantes — Structs, Enums e o Escopo Global</a>
<a href="./capitulo_8.html">Capítulo 8: Indireção e Memória — Uma Análise de Ponteiros</a>
<a href="./capitulo_9.html">Capítulo 9: A Arquitetura da Memória e o Gerenciamento Dinâmico</a>
<del><a href="./capitulo_10_errado.html">Capítulo 10: Gerenciamento de Recursos como um Princípio — Ponteiros Inteligentes e a Semântica de Posse</a></del>
<a href="./capitulo_10.html">Capítulo 10: Posse Exclusiva e Gerenciamento de Recursos — Uma Análise de std::unique<sub>ptr</sub></a>
<a href="./capitulo_11.html">Capítulo 11: Posse Compartilhada e o Ciclo de Vida Colaborativo — std::shared<sub>ptr</sub></a>
<a href="./capitulo_12.html">Capítulo 12: Observação Não-Proprietária e a Quebra de Ciclos de Referência — std::weak<sub>ptr</sub></a>
<a href="./capitulo_13.html">Capítulo 13: Manipulação de Tipos e Auto-Referência em Posse Compartilhada</a>
<a href="./analose_const.html">Análise da Palavra-chave const em Métodos de Membro</a>
<a href="./virtual_override.html">Análise de virtual e override</a>
<a href="./capitulo_14.html">Capítulo 14: Interagindo com o Mundo Exterior — Manipulação de Arquivos em C++</a>
<a href="./topicos_arquivos_teriminou.html">O Tópico de Arquivos Terminou? Não, e Eis o Que Falta:</a>
<a href="./capitulo_15.html">Capítulo 15: Mecânica Avançada de I/O — Estado, Acesso Aleatório e Performance</a>
<a href="./capitulo_16.html">Capítulo 16: Construindo Abstrações — A class e o Encapsulamento</a>
<a href="./capitulo_17.html">Capítulo 17: Hierarquias e Comportamento Dinâmico — Herança e Polimorfismo</a>
<del><a href="./capitulo_18_errado.html">Capítulo 18: Organização de Código — Do Pré-processador aos Módulos do C++20</a></del>
<a href="./capitulo_18.html">Capítulo 18 (Revisado e Aprofundado): Dominando o Modelo Clássico — Headers, Linkagem e o Pré-processador</a>
<a href="./capitulo_19.html">Capítulo 19: A Arquitetura Moderna — Módulos, Partições e Interfaces</a>
<a href="./capitulo_20.html">Capítulo 20: Da Linha de Comando à Automação — Construindo Projetos com make e Makefile</a>
<del><a href="./capitulo_21_errado.html">Capítulo 21: A Anatomia de um Projeto CPP Canônico — Estrutura de Diretórios e Filosofia</a></del>
<a href="./capitulo_21.html">Capítulo 21: A Filosofia da Estrutura de Diretórios — Um Blueprint para a Clareza</a>
<a href="./capitulo_22.html">Capítulo 22: Gerenciamento de Dependências — Construindo Sobre os Ombros de Gigantes</a>
<a href="./capitulo_23.html">Capítulo 23: A Meta-Programação do Build — Dominando o CMake</a>
<a href="./capitulo_24.html">Capítulo 24: A Filosofia da STL e a Genialidade dos Iteradores</a>
<a href="./capitulo_25.html">Capítulo 25: Contêineres Sequenciais — Gerenciando Coleções Ordenadas</a>
<a href="./capitulo_26.html">Capítulo 26: Contêineres Associativos — Busca e Recuperação Eficientes</a>
<a href="./capitulo_27.html">Capítulo 27: O Poder do &lt;algorithm&gt; e a Programação Expressiva</a>
<a href="./capitulo_28.html">Capítulo 28: A Natureza da Lambda — O Functor Anônimo</a>
<a href="./capitulo_29.html">Capítulo 29: A Alma da Lambda — Mecânica de Captura em Detalhe</a>
<a href="./capitulo_30.html">Capítulo 30: Estado e Mutabilidade em Lambdas</a>
<a href="./capitulo_31.html">Capítulo 31: Lambdas e a Programação Genérica</a>
<a href="./capitulo_32.html">Capítulo 32: Padrões de Uso e Técnicas Avançadas com Lambdas</a>
<a href="./capitulo_33.html">Capítulo 33: A Mecânica do Lançamento — throw e o Desenrolamento da Pilha</a>
<a href="./capitulo_34.html">Capítulo 34: A Arte da Captura — catch e a Hierarquia de Exceções</a>
<a href="./capitulo_35.html">Capítulo 35: O Contrato de Segurança — Garantias de Exceção</a>
<a href="./capitulo_36.html">Capítulo 36: O Especificador noexcept — Uma Análise Profunda</a>
<a href="./capitulo_37.html">Capítulo 37: Além das Exceções — Tratamento de Erros no C++ Moderno</a>
<a href="./capitulo_38.html">Capítulo 38: A Regra dos Três — O Paradigma Clássico de Gerenciamento de Recursos</a>
<a href="./capitulo+39.html">Capítulo 39: A Regra dos Cinco — A Evolução com a Semântica de Movimento (C++11)</a>
<a href="./capitulo_40.html">Capítulo 40: A Regra do Zero — A Filosofia do C++ Moderno</a>
<a href="./capitulo_41.html">Capítulo 41: Uma Nuance Final — O Padrão Copy-and-Swap</a>
<a href="./capitulo_42.html">Capítulo 42: Herança — Construindo Hierarquias de Tipos</a>
<a href="./capitulo_43.html">Capítulo 43: Polimorfismo — Uma Interface, Múltiplas Formas</a>
<a href="./capitulo_44.html">Capítulo 44: Classes Abstratas e Interfaces</a>
<a href="./capitulo_45.html">Capítulo 45: A Regra de Ouro — Destrutores Virtuais</a>
<a href="./capitulo_bonus.html">Capítulo Bônus: A Arte e os Perigos do cast em C++</a>
<a href="./capitulo_46.html">Capítulo 46: Introdução às Threads (std::thread)</a>
<a href="./capitulo_47.html">Capítulo 47: O Perigo — Condições de Corrida e Dados Compartilhados</a>
<a href="./capitulo_48.html">Capítulo 48: A Solução — Mutexes e Locks para Exclusão Mútua</a>
<a href="./capitulo_49.html">Capítulo 49: Operações Atômicas (std::atomic)</a>
<a href="./capitulo_50.html">Capítulo 50: Tarefas e o Futuro (std::async, std::future, std::promise)</a>
<a href="./capitulo_51.html">Capítulo 51: Testes Expressivos com Catch2 — A Filosofia e a Prática</a>
<a href="./capitulo_52.html">Capítulo 52: Forjando Ferramentas — Construindo um Micro-Framework de Testes</a>
<a href="./capitulo_53.html">Capítulo 53: Forjando Ferramentas — A Arte da Asserção</a>
</p>

<p>
<span class="underline"><span class="underline"><span class="underline"><span class="underline"><span class="underline"><span class="underline"><span class="underline"><span class="underline"><span class="underline"><span class="underline"><span class="underline"><span class="underline"><span class="underline"><span class="underline"><span class="underline"><span class="underline"><span class="underline"><span class="underline"><span class="underline"><span class="underline"><span class="underline"><span class="underline"><span class="underline"><span class="underline"><span class="underline"><span class="underline"><span class="underline"><span class="underline"><span class="underline"><span class="underline"><span class="underline"><span class="underline"><span class="underline"><span class="underline"><span class="underline"><span class="underline"><span class="underline"><span class="underline"><span class="underline"><span class="underline"><span class="underline"><span class="underline"><span class="underline"><span class="underline"><span class="underline"><span class="underline"><span class="underline"><span class="underline"><span class="underline"><span class="underline"><span class="underline"><span class="underline"><span class="underline"><span class="underline"><span class="underline"><span class="underline"><span class="underline"><span class="underline"><span class="underline"><span class="underline"><span class="underline"><span class="underline"><span class="underline">_</span></span></span></span></span></span></span></span></span></span></span></span></span></span></span></span></span></span></span></span></span></span></span></span></span></span></span></span></span></span></span></span></span></span></span></span></span></span></span></span></span></span></span></span></span></span></span></span></span></span></span></span></span></span></span></span></span></span></span></span></span></span></span>
</p>
</div>
</div>
