cpp_moderno_indice.html
<div id="outline-container-org57df139" class="outline-2">
<h2 id="org57df139"><span class="section-number-2">2.</span> Introdução</h2>
<div class="outline-text-2" id="text-2">
<p>
Este livro não é um guia para aprender C++. Ele não trata do básico da linguagem, nem das boas práticas mais conhecidas que se repetem desde sua criação. O objetivo aqui é outro: explorar C++ como um <b>instrumento intelectual de engenharia de software</b>, um espaço onde paradigmas se cruzam — orientação a objetos, programação genérica, metaprogramação, programação funcional e sistemas de baixo nível.
</p>

<p>
A ideia é levar o leitor além daquilo que já se encontra em guias introdutórios, apresentando a linguagem como um <b>laboratório de ideias</b> para arquiteturas modernas, exploração de desempenho, paralelismo e integração em ecossistemas complexos.
</p>

<p>
Ao longo de mais de cem capítulos, cada seção é organizada em torno de temas que exigem não apenas conhecimento técnico, mas também reflexão sobre <b>design, manutenção, interoperabilidade e futuro da linguagem</b>. O livro serve tanto como um mapa para engenheiros experientes que desejam aprofundar seus conhecimentos, quanto como um repositório de ideias para pesquisadores e profissionais que veem no C++ um ponto de encontro entre teoria e prática.
</p>
</div>
</div>
<div id="outline-container-org24ecd8d" class="outline-2">
<h2 id="org24ecd8d"><span class="section-number-2">3.</span> Estrutura do Livro</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org0403b29" class="outline-3">
<h3 id="org0403b29"><span class="section-number-3">3.1.</span> Parte I — A Profundidade da Linguagem</h3>
<div class="outline-text-3" id="text-3-1">
<p>
<b>Motivação</b>: Revisitar C++ moderno como linguagem de múltiplos paradigmas e entender como decisões de design se refletem em código de alto impacto.
</p>

<p>
<i>Capítulos</i>:
</p>

<p>
<a href="./novos_capitulos/capitulo_1.html">01. O C++ além do básico</a>
</p>

<p>
<a href="./novos_capitulos/capitulo_2.html">02. Filosofia da evolução: de 2011 a 2023</a>
[./novos<sub>capitulos</sub>/capitulo<sub>3.org</sub>]03. RAII repensado em sistemas modernos
[./novos<sub>capitulos</sub>/capitulo<sub>4.org</sub>]04. O verdadeiro poder do <i>auto</i>
[./novos<sub>capitulos</sub>/capitulo<sub>5.org</sub>]05. Referências vs. ponteiros: decisões de design
[./novos<sub>capitulos</sub>/capitulo<sub>6.org</sub>]06. Semântica de movimento em arquiteturas complexas
[./novos<sub>capitulos</sub>/capitulo<sub>7.org</sub>]07. Forwarding perfeito: quando e por quê
[./novos<sub>capitulos</sub>/capitulo<sub>8.org</sub>]08. Inicialização moderna: uniform, structured, designated
[./novos<sub>capitulos</sub>/capitulo<sub>9.org</sub>]09. <i>constexpr</i>: programação entre dois mundos
[./novos<sub>capitulos</sub>/capitulo<sub>10.org</sub>]10. Tipos fortes e segurança semântica
[./novos<sub>capitulos</sub>/capitulo<sub>11.org</sub>]11. Casting explícito e seus perigos
[./novos<sub>capitulos</sub>/capitulo<sub>12.org</sub>]12. Namespaces, módulos e fronteiras de sistemas
[./novos<sub>capitulos</sub>/capitulo<sub>13.org</sub>]13. Exceções vs. código robusto sem exceções
[./novos<sub>capitulos</sub>/capitulo<sub>14.org</sub>]14. Idiomas escondidos no core da linguagem
[./novos<sub>capitulos</sub>/capitulo<sub>15.org</sub>]15. Filosofia da complexidade em C++
</p>

<p>
<i>Leituras complementares</i>:
<b>Livros:</b>
Bjarne Stroustrup — The Design and Evolution of C++
Scott Meyers — Effective Modern C++
Anthony Williams — Professional C++
</p>

<p>
<b>Artigos e papers:</b>
ISO C++ Committee papers (WG21) sobre evolução da linguagem.
Herb Sutter — Trip Reports from WG21 Meetings (publicados regularmente).
Journal of Object Technology: artigos sobre RAII e exception safety.
</p>

<p>
<b>Revistas e conferências:</b>
ACM SIGPLAN Notices (papers sobre semântica e linguagem).
CppCon (talks sobre RAII, move semantics, constexpr).
</p>
</div>
</div>
<div id="outline-container-org0088b9c" class="outline-3">
<h3 id="org0088b9c"><span class="section-number-3">3.2.</span> Parte II — Templates e Programação Genérica</h3>
<div class="outline-text-3" id="text-3-2">
<p>
<b>Motivação</b>: Templates não são apenas ferramentas de reuso, mas o alicerce de um estilo de programação.
</p>

<p>
<i>Capítulos</i>:
</p>

<ol class="org-ol">
<li>Templates como alicerce de arquitetura</li>
<li>Dedução de tipos: o compilador como aliado</li>
<li>SFINAE — erros que viram design</li>
<li>Concepts: um novo contrato para C++</li>
<li>Constraints expressivas</li>
<li>Tipos dependentes e contexto de compilação</li>
<li>Especialização de templates: arte e armadilhas</li>
<li>Polimorfismo estático com CRTP</li>
<li>Variadic templates e abstrações poderosas</li>
<li>Templates recursivos: design em cascata</li>
<li>Metafunções e manipulação de tipos</li>
<li>Idioma tag dispatching</li>
<li>Abstrações genéricas em containers</li>
<li>Bibliotecas genéricas: elegância vs. usabilidade</li>
<li>Templates como linguagem própria</li>
</ol>

<p>
<i>Leituras complementares</i>: 
<b>Livros:</b>
David Vandevoorde, Nicolai Josuttis, Douglas Gregor — C++ Templates: The Complete Guide
Andrei Alexandrescu — Modern C++ Design
Matthew Austern — Generic Programming and the STL
</p>

<p>
<b>Artigos e papers</b>:
Stepanov &amp; Musser — Generic Programming (artigo seminal, 1989).
Research papers sobre concepts em ACM Transactions on Programming Languages and Systems (TOPLAS).
Eric Niebler — artigos sobre Ranges e design genérico.
</p>

<p>
<b>Revistas e conferências</b>:
Dr. Dobb’s Journal (arquivo de artigos clássicos de templates).
CppNow (palestras sobre concepts, SFINAE e CRTP).
</p>
</div>
</div>
<div id="outline-container-org74d81b6" class="outline-3">
<h3 id="org74d81b6"><span class="section-number-3">3.3.</span> Parte III — Metaprogramação e Compile-Time Magic</h3>
<div class="outline-text-3" id="text-3-3">
<p>
<b>Motivação</b>: Transformar o compilador em um “motor de execução” que trabalha antes mesmo do runtime.
</p>

<p>
<i>Capítulos</i>:
</p>

<ol class="org-ol">
<li>História da metaprogramação em C++</li>
<li>TMP clássico: listas, ifs e recursão</li>
<li>std::integral<sub>constant</sub> e a base de tudo</li>
<li>constexpr em profundidade</li>
<li>if constexpr: elegância sem redundância</li>
<li>Tipos em tempo de compilação: std::type<sub>identity</sub>, decltype</li>
<li>Expressões lambda em tempo de compilação</li>
<li>Template lambdas e dedução avançada</li>
<li>Reflection: presente e futuro</li>
<li>Gerando código em tempo de compilação</li>
<li>Tabelas e algoritmos constexpr</li>
<li>Construção de DSLs internas</li>
<li>Biblioteca MPL e seu legado</li>
<li>Boost.Hana e metaprogramação moderna</li>
<li>Filosofia: programar no compilador</li>
</ol>

<p>
<i>Leituras complementares</i>: C++ Template Metaprogramming (Abrahams &amp; Gurtovoy), artigos sobre boost::mpl e std::mp.
<b>Livros:</b>
David Abrahams, Aleksey Gurtovoy — C++ Template Metaprogramming
Louis Dionne — artigos sobre Boost.Hana
Jason Turner — C++ Best Practices (capítulos sobre constexpr e compile-time).
</p>

<p>
<b>Artigos e papers</b>:
Eric Niebler — Ranges and Metaprogramming (palestras e artigos).
Papers do WG21 sobre Reflection e Constexpr.
Andrei Alexandrescu — artigos da CUJ (C++ Users Journal) sobre metaprogramação.
</p>

<p>
<b>Revistas e conferências:</b>
ACM SIGPLAN Conference on Programming Language Design and Implementation (PLDI).
CppCon e Meeting C++ (talks sobre metaprogramação).
</p>
</div>
</div>
