cpp_moderno_indice.html
<div id="outline-container-orgd91e3c4" class="outline-3">
<h3 id="orgd91e3c4"><span class="section-number-3">3.4.</span> Parte IV — Arquitetura e Design com C++</h3>
<div class="outline-text-3" id="text-3-4">
<p>
<b>Motivação</b>: Usar C++ como terreno de experimentação para arquiteturas grandes e resilientes.
</p>

<p>
<i>Capítulos</i>:
</p>

<ol class="org-ol">
<li>O peso de um sistema em C++</li>
<li>Design orientado a componentes</li>
<li>Interfaces robustas em bibliotecas C++</li>
<li>Polimorfismo estático vs. dinâmico</li>
<li>Padrão pImpl (pointer to implementation)</li>
<li>Gerenciamento explícito de dependências</li>
<li>Dependency Injection em C++</li>
<li>Modelagem com mixins e traits</li>
<li>Builders e factories modernos</li>
<li>Herança como problema, composição como solução</li>
<li>Coesão e acoplamento em sistemas C++</li>
<li>APIs seguras e versionáveis</li>
<li>Testabilidade em arquiteturas grandes</li>
<li>Evolução de bibliotecas internas</li>
<li>Manutenibilidade em décadas de código legado</li>
</ol>

<p>
<i>Leituras complementares</i>:
<b>Livros</b>:
</p>

<p>
John Lakos — Large-Scale C++ Software Design
John Lakos — Large-Scale C++ Volume I: Process and Architecture
Martin Fowler — Patterns of Enterprise Application Architecture (não é C++-específico, mas aplicável).
Robert C. Martin — Clean Architecture
</p>

<p>
<b>Artigos e papers:</b>
Herb Sutter — Exceptional C++ series (design orientado a exceções e robustez).
IEEE Software — artigos sobre arquitetura de sistemas em C++.
Padrões de projeto revisitados em C++.
</p>

<p>
<b>Revistas e conferências:</b>
IEEE Software
ACM Queue
Palestras de John Lakos em CppCon.
</p>
</div>
</div>
<div id="outline-container-org2199edb" class="outline-3">
<h3 id="org2199edb"><span class="section-number-3">3.5.</span> Parte V — Programação de Baixo Nível e Desempenho</h3>
<div class="outline-text-3" id="text-3-5">
<p>
<b>Motivação</b>: C++ ainda é a linguagem da fronteira entre hardware e software.
</p>

<p>
<i>Capítulos</i>:
</p>

<ol class="org-ol">
<li>A relação íntima com o hardware</li>
<li>Ponteiros crus em ecossistema moderno</li>
<li>Smart pointers além do óbvio</li>
<li>Alocadores customizados em containers</li>
<li>placement new e técnicas avançadas</li>
<li>Alinhamento de memória e performance</li>
<li>Estruturas cache-friendly</li>
<li>Vetorização e SIMD em C++</li>
<li>Intrinsics e otimizações manuais</li>
<li>Inline assembly moderno</li>
<li>Benchmarking sério em C++</li>
<li>Profiling com ferramentas do compilador</li>
<li>Evitando regressões de performance</li>
<li>Zero-cost abstractions na prática</li>
<li>Filosofia da otimização extrema</li>
</ol>

<p>
<i>Leituras complementares</i>: High Performance C++ (Sutter &amp; Alexandrescu), Intel manuals.
<b>Livros</b>:
</p>

<p>
Alexandrescu &amp; Sutter — C++ Coding Standards
Agner Fog — Optimizing Software in C++
Kurt Guntheroth — Optimized C++
</p>

<p>
<b>Artigos e papers</b>:
Intel Developer Manuals (otimizações, vetorização).
Research papers sobre cache-aware data structures (ACM SIGARCH).
Agner Fog — Instruction Tables e microarquitetura.
</p>

<p>
<b>Revistas e conferências</b>:
IEEE Transactions on Computers
HotChips (conference)
CppCon talks sobre alocadores customizados e performance extrema.
</p>
</div>
</div>
<div id="outline-container-orgea00311" class="outline-3">
<h3 id="orgea00311"><span class="section-number-3">3.6.</span> Parte VI — Concorrência e Computação Distribuída</h3>
<div class="outline-text-3" id="text-3-6">
<p>
<b>Motivação</b>: C++ moderno como ferramenta para lidar com paralelismo e escalabilidade.
</p>

<p>
<i>Capítulos</i>:
</p>

<ol class="org-ol">
<li>Concorrência como paradigma inevitável</li>
<li>std::thread: o básico que engana</li>
<li>Futures, promises e std::async</li>
<li>std::mutex e armadilhas de bloqueio</li>
<li>Modelos de memória em profundidade</li>
<li>Atomicidade e std::atomic</li>
<li>Estruturas lock-free e wait-free</li>
<li>Paralelismo em STL (std::execution)</li>
<li>Produtor-consumidor em C++ moderno</li>
<li>Concorrência com tasks</li>
<li>Corrotinas e fluxo assíncrono</li>
<li>Design de sistemas paralelos em C++</li>
<li>Programação distribuída com RPC</li>
<li>C++ em sistemas de alta escalabilidade</li>
<li>Filosofia: paralelismo como linguagem</li>
</ol>

<p>
<i>Leituras complementares</i>:
<b>Livros</b>:
Anthony Williams — C++ Concurrency in Action
Maurice Herlihy, Nir Shavit — The Art of Multiprocessor Programming
Andrew Tanenbaum — Distributed Systems
</p>

<p>
<b>Artigos e papers</b>:
Herb Sutter — Writing Lock-Free Code: A Corrected Approach.
Research papers sobre lock-free algorithms (ACM &amp; IEEE).
Papers do WG21 sobre std::atomic e corrotinas.
</p>

<p>
<b>Revistas e conferências</b>:
ACM Transactions on Computer Systems
PPoPP (Symposium on Principles and Practice of Parallel Programming)
Talks CppCon/CppNow sobre corrotinas e std::execution.
</p>
</div>
</div>
<div id="outline-container-org4ec3777" class="outline-3">
<h3 id="org4ec3777"><span class="section-number-3">3.7.</span> Parte VII — C++ no Ecossistema Moderno</h3>
<div class="outline-text-3" id="text-3-7">
<p>
<b>Motivação</b>: A linguagem não vive isolada, mas integrada a ecossistemas diversos.
</p>

<p>
<i>Capítulos</i>:
</p>

<ol class="org-ol">
<li>C++ como hub de integração</li>
<li>ABI e compatibilidade binária</li>
<li>Interoperabilidade com C</li>
<li>Conversando com Fortran em HPC</li>
<li>Python + C++ com Pybind11</li>
<li>Rust e C++: rivais ou aliados?</li>
<li>Bindings para linguagens de alto nível</li>
<li>Embarcados: C++ em microcontroladores</li>
<li>Sistemas em tempo real</li>
<li>GPU computing com CUDA</li>
<li>OpenCL vs. SYCL vs. C++</li>
<li>WebAssembly + C++</li>
<li>Ferramentas modernas de build (CMake, Meson, Bazel)</li>
<li>Análise estática e sanitizers</li>
<li>CI/CD aplicado a C++</li>
</ol>

<p>
<i>Leituras complementares</i>: 
<b>Livros</b>:
Nicolai Josuttis — The C++ Standard Library
Jason Turner — Practical C++
Mark Harris — CUDA by Example
Programming WebAssembly with C++ and Rust
</p>

<p>
<b>Artigos e papers</b>:
LLVM/Clang docs — ABI, linking e interoperabilidade.
Pybind11 documentation.
Papers da Khronos Group sobre SYCL e OpenCL.
</p>

<p>
<b>Revistas e conferências</b>:
ACM Computing Surveys (interoperabilidade e linguagens).
GTC (NVIDIA GPU Technology Conference).
Emscripten/LLVM talks.
</p>
</div>
</div>
<div id="outline-container-orgce32298" class="outline-3">
<h3 id="orgce32298"><span class="section-number-3">3.8.</span> Parte VIII — O Futuro do C++</h3>
<div class="outline-text-3" id="text-3-8">
<p>
<b>Motivação</b>: Olhar para frente, discutindo tanto a evolução técnica quanto filosófica.
</p>

<p>
<i>Capítulos</i>:
</p>

<ol class="org-ol">
<li>C++26: o que vem pela frente</li>
<li>Contracts: segurança formal no código</li>
<li>Pattern Matching em C++</li>
<li>Filosofia da longevidade em software</li>
<li>O papel do C++ em um mundo com Rust e Go</li>
</ol>

<p>
<i>Leituras complementares</i>:
<b>Livros</b>:
Herb Sutter (futuros livros / drafts WG21).
Scott Meyers — More Effective C++ (reflexões que ainda ecoam).
Andrei Alexandrescu — ensaios sobre linguagem e design.
</p>

<p>
<b>Artigos e papers</b>:
WG21 proposals sobre contracts, pattern matching e reflection.
Debates C++ vs. Rust em ACM Queue.
Artigos filosóficos sobre longevidade de software (IEEE).
</p>

<p>
<b>Revistas e conferências</b>:
Communications of the ACM (discussões sobre o futuro das linguagens).
Talks de Bjarne Stroustrup e Herb Sutter em CppCon.
Meeting C++ painéis sobre futuro da linguagem.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2025-09-09 Tue 12:09</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
